# Ejercicios Nivel Básico

In [3]:
# Importando Librerías
import pandas as pd
import numpy as np

1. Creación de DataFrame:

Crea un DataFrame con al menos tres columnas y cinco filas. Puedes inventar datos o utilizar datos reales.

In [22]:
dict = {
    'column1': np.random.randint(1,100,5),
    'column2': np.random.randint(1,100,5),
    'column3': np.random.randint(1,100,5),
    'column4': np.random.randint(1,100,5),
    'column5': np.random.randint(1,100,5)
}
df = pd.DataFrame(dict)
print(df)

   column1  column2  column3  column4  column5
0       87       50       21       61       17
1       50       50       63       81       92
2       33       29       13       12       87
3       79       36       94       70       91
4       63       30       87        9       10

2. Selección de Datos:

A partir del DataFrame anterior, selecciona e imprime solo las filas pares.

In [12]:
df[2::2]

   column1  column2  column3  column4  column5
2        7        3        3        6        6
4        1        4        7        2        2

3. Operaciones Básicas:

Realiza operaciones básicas como suma, resta, multiplicación y división en una columna específica de tu DataFrame.

In [20]:
print("Operaciones estadisticas")
print(df.describe())

print("Suma de column1")
print(df['column1'].add(10))

print("Resta de column2")
print(df['column2'].sub(2))

print("Multiplicación de column3")
print(df['column3'].mul(3))

print("Division de column4")
print(df['column4'].div(2))

Operaciones estadisticas
        column1   column2   column3   column4   column5
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   4.800000  2.400000  4.400000  5.200000  4.200000
std    3.193744  1.341641  2.073644  2.167948  2.280351
min    1.000000  1.000000  2.000000  2.000000  2.000000
25%    3.000000  1.000000  3.000000  5.000000  2.000000
50%    4.000000  3.000000  4.000000  5.000000  4.000000
75%    7.000000  3.000000  6.000000  6.000000  6.000000
max    9.000000  4.000000  7.000000  8.000000  7.000000
Suma de column1
0    14
1    19
2    17
3    13
4    11
Name: column1, dtype: int64
Resta de column2
0   -1
1    1
2    1
3   -1
4    2
Name: column2, dtype: int64
Multiplicación de column3
0    18
1     6
2     9
3    12
4    21
Name: column3, dtype: int64
Division de column4
0    2.5
1    2.5
2    3.0
3    4.0
4    1.0
Name: column4, dtype: float64

4. Filtrado de Datos:

Filtra el DataFrame para mostrar solo las filas donde el valor en una columna específica sea mayor que 10.

In [23]:
df[df>10]

   column1  column2  column3  column4  column5
0       87       50       21     61.0     17.0
1       50       50       63     81.0     92.0
2       33       29       13     12.0     87.0
3       79       36       94     70.0     91.0
4       63       30       87      NaN      NaN

5. Agrupación y Resumen:

Agrupa el DataFrame por una columna y calcula la suma o el promedio de otra columna.

In [26]:
df.groupby('column1').sum()

         column2  column3  column4  column5
column1
33            29       13       12       87
50            50       63       81       92
63            30       87        9       10
79            36       94       70       91
87            50       21       61       17